Merge pull request #222 from BenoitGoethals/develop
Put in production
